{"symbol": "ADBE", "name": "Adobe Inc.", "sector": "Technology", "industry": "Software - Application", "country": "United States", "exchange": "NMS", "currency": "USD", "market_cap": 164389601280, "pe_ratio": 25.442612, "forward_pe": 18.769342, "pb_ratio": 12.813008, "dividend_yield": null, "beta": 1.37, "description": "Adobe Inc., together with its subsidiaries, operates as a technology company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products and services that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows subscribers to use its creative products and applications (apps) integrated with cloud-delivered services across various surfaces and platforms. This segment serves photographers, video editors, graphic and experience designers, and game developers; content creators, students, marketers, and knowledge workers; and consumers. The Digital Experience segment provides an integrated platform and set of products, services, and solutions that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Adobe Advertising offerings. It provides consulting, training, customer management, technical support, and learning services. The company offers its solutions directly to enterprise customers through its sales force and local field offices, and directly to businesses and consumers, as well as licenses its products to end-user customers through app stores and website at adobe.com. It markets and distributes its products through sales channels, including distributors, retailers, software developers, mobile app stores, systems integrators, independent software vendors, value-added resellers, and original equipment and hardware manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.", "website": "https://www.adobe.com", "employees": 30709, "logo_url": null, "type": "Stock", "last_updated": "2025-03-29", "return_on_equity": 0.47284, "return_on_assets": 0.17194, "profit_margins": 0.30635, "operating_margins": 0.37854, "gross_margins": 0.89155}