{"symbol": "BRK.B", "name": "Berkshire Hathaway Inc.", "sector": "Financial Services", "industry": "Insurance - Diversified", "country": "United States", "exchange": "NYQ", "currency": "USD", "market_cap": 1113931120640, "pe_ratio": 12.516967, "forward_pe": 25.719622, "pb_ratio": 0.0011441904, "dividend_yield": null, "beta": 0.802, "description": "Berkshire Hathaway Inc., through its subsidiaries, engages in the insurance, freight rail transportation, and utility businesses worldwide. The company provides property, casualty, life, accident, and health insurance and reinsurance; operates railroad systems in North America; generates, transmits, stores, and distributes electricity from natural gas, coal, wind, solar, hydroelectric, nuclear, and geothermal sources; operates natural gas distribution and storage facilities, interstate pipelines, liquefied natural gas facilities, and compressor and meter stations; and holds interest in coal mining assets. It also manufactures boxed chocolates and other confectionery products; specialty chemicals, metal cutting tools, and components for aerospace and power generation applications; prefabricated and site-built residential homes, flooring products; insulation, roofing, and engineered products; building and engineered components; paints and coatings; and bricks and masonry products, as well as offers manufactured and site-built home construction, and related lending and financial services. In addition, the company provides recreational vehicles, apparel, and footwear products; toys, jewelry, and custom picture framing products; alkaline batteries; castings, forgings, fasteners/fastener systems, aerostructures, and precision components; and cobalt, nickel, and titanium alloys. Further, it distributes televisions and information, and grocery and non-food consumer products; franchises and services quick service restaurants; distributes electronic components; and offers logistics services, and professional aviation training and shared aircraft ownership programs. Additionally, the company retails automobiles; furniture, bedding, and accessories; household appliances, electronics, and floor coverings; watches, crystal, china, stemware, flatware, gifts, and collectibles; sells kitchenware; and motorcycle clothing and equipment. Berkshire Hathaway Inc. was incorporated in 1998 and is headquartered in Omaha, Nebraska.", "website": "https://www.berkshirehathaway.com", "employees": 392400, "logo_url": null, "type": "Stock", "last_updated": "2025-04-17", "return_on_equity": 0.14653, "return_on_assets": 0.063930005, "profit_margins": 0.23959999, "operating_margins": 0.25908002, "gross_margins": 0.30621}