{"symbol": "MMM", "name": "3M Company", "sector": "Industrials", "industry": "Conglomerates", "country": "United States", "exchange": "NYQ", "currency": "USD", "market_cap": 78114816000, "pe_ratio": 19.950413, "forward_pe": 18.334177, "pb_ratio": 20.336983, "dividend_yield": 2.02, "beta": 1.017, "description": "3M Company provides diversified technology services in the Americas, the Asia Pacific, Europe, the Middle East, Africa, and internationally. It operates through three segments: Safety and Industrial, Transportation and Electronics, and Consumer. The Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; industrial specialty products, such as personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. The Transportation and Electronics segment provides ceramic solutions; attachment/bonding, films, sound, and temperature management for transportation vehicles; format graphic films for advertising and fleet signage; reflective signage for highway and vehicle safety; light management films and electronics assembly solutions; chip packaging and interconnection solutions; semiconductor production materials; and data center solutions. The Consumer segment offers cleaning products for the home; consumer air quality products; picture hanging accessories; retail abrasives, paint accessories, and safety products; stationery and office products; automotive appearance products; and consumer bandages, tapes, braces, and supports. The company offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers, as well as directly to users. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.", "website": "https://www.3m.com", "employees": 61500, "logo_url": null, "type": "Stock", "last_updated": "2025-03-29", "return_on_equity": 0.91850996, "return_on_assets": 0.05929, "profit_margins": 0.16981001, "operating_margins": 0.17671, "gross_margins": 0.41335}